package buaa.act.ucar.bricks.extract_obd;

public class CommonConfig {
	public static String[] fields = { "gpstime", "灯状态(远光灯)", "灯状态(近光灯)", "灯状态(示宽灯)", "灯状态(雾灯)", "灯状态(左转向)", "灯状态(右转向)",
			"灯状态(危险灯)", "门状态(左前门)", "门状态(右前门)", "门状态(左后门)", "门状态(右后门)", "门状态(后备箱\\尾箱)", "门锁(全车锁)", "门锁(左前门)", "门锁(右前门)",
			"门锁(左后门)", "门锁(右后门)", "门锁(后备箱\\尾箱)", "窗状态(左前窗)", "窗状态(右前窗)", "窗状态(左后窗)", "窗状态(右后窗)", "窗状态(天窗)", "故障信号(ECM)",
			"故障信号(ABS)", "故障信号(SRS)", "报警信号(机油)", "报警信号(胎压)", "报警信号(保养)", "手刹状态", "刹车状态(脚刹)", "安全带(驾驶员)", "安全带(副驾)",
			"ACC信号", "钥匙状态", "遥控信号", "雨刮状态", "空调开关", "档位", "里程(总)", "里程(续航)", "用油量", "水温", "发动机进气温度", "空调车内温度",
			"电池当前电压", "左前轮轮速", "右前轮轮速", "左后轮轮速", "右后轮轮速", "车速", "转速", "油耗(平均)", "油耗(瞬时)", "油耗(瞬时)", "机油寿命", "空气流量",
			"进气歧管绝对压力", "油门踏板相对位置", "油门踏板", "方向盘转角角度", "方向盘转向角状态", "滤波后剩余油量", "滤波后剩余油量", "累计里程", "里程ID", "APK电池当前电压",
			"汽车加速度", "刹车踏板相对位置" };
	public static String[] keys = { "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14",
			"15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32",
			"33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50",
			"51", "52", "53", "54", "55", "56", "57", "58", "59", "60", "61", "62", "63", "64", "65", "66", "67", "68",
			"69" };
	public static final String TIMESTAMP_KEY = "0";
	public static final String SPEED_KEY = "51";
}
